/***************************************************************************
 *
 * Copyright 2015-2025 BES.
 * All rights reserved. All unpublished rights reserved.
 *
 * No part of this work may be used or reproduced in any form or by any
 * means, or stored in a database or retrieval system, without prior written
 * permission of BES.
 *
 * Use of this work is governed by a license granted by BES.
 * This work contains confidential and proprietary information of
 * BES. which is protected by copyright, trade secret,
 * trademark and other intellectual property rights.
 *
 ****************************************************************************/
#ifndef __BT_GAP_SERVICE_H__
#define __BT_GAP_SERVICE_H__

/**
 * INCLUDE FILES
 *
 */

#include "adapter_service.h"

/**
 * MACRO DEFINES
 *
 *
 */
#define GAP_UNKNOWN_TX_POWER                        (0x7F)
#define GAP_UNKNOWN_RSSI                            (0x7F)
#define GAP_UNKNOWN_CONN_INTERVAL                   (0xFFFF)
#define GAP_INVALID_CONIDX                          (0xFF)
#define GAP_INVALID_ADV_HANDLE                      (0xFF)
#define GAP_INVALID_SCAN_HANDLE                     (0xFF)
#define GAP_INVALID_INIT_HANDLE                     (0xFF)
#define GAP_INVALID_ADV_SET_ID                      (0xFF)
#define GAP_PA_NO_SUBEVENT                          (0xFF)
#define GAP_INVALID_SYNC_HANDLE                     (0xFFFF)
#define GAP_INVALID_CONN_HANDLE                     (0xFFFF)

    GAP_INIT_FILTER_POLICY_USE_FILTER_NO_DECISIONS  = 0x01,
    /// Only process all decisions no filter
    GAP_INIT_FILTER_POLICY_NO_FILTER_ALL_DECISIONS  = 0x02,
    /// Use filter to all pdus
    GAP_INIT_FILTER_POLICY_USE_FILTER_TO_ALL_PDUS   = 0x03,
    /// Process all decisions and other PDUs use filter
    GAP_INIT_FILTER_POLICY_OTHER_FILTER_DECISIONS   = 0x04,

    GAP_INIT_FILTER_POLICY_MASK                     = 0x07,
};

typedef enum
{
    GAP_INIT_EVENT_SCAN_STARTED = BT_EVENT_GAP_SCAN_EVENT_START,
    GAP_INIT_EVENT_SCAN_STOPPED,
    GAP_INIT_EVENT_SCAN_ADV_REPORT,
    GAP_INIT_EVENT_SCAN_MONITORED_ADV_REPORT,
    GAP_INIT_EVENT_INIT_STARTED, // initiating started to start creating connection
    GAP_INIT_EVENT_INIT_STOPPED, // initiating stopped due to conn established or failed
    GAP_INIT_EVENT_CONN_OPENED = BT_EVENT_GAP_CONN_EVENT_START,
    GAP_INIT_EVENT_CONN_CLOSED,
    GAP_INIT_EVENT_CONN_FAILED,
    GAP_INIT_EVENT_CONN_CACHE,
    GAP_INIT_EVENT_CONN_MTU_EXCHANGED,
    GAP_INIT_EVENT_USER_CONFIRM,
    GAP_INIT_EVENT_CONN_ENCRYPTED,
    GAP_INIT_EVENT_RECV_KEY_DIST,
    GAP_INIT_EVENT_CONN_UPDATE_REQ,
    GAP_INIT_EVENT_CONN_PARMS_UPDATE,
    GAP_INIT_EVENT_CONN_SUBRATE_CHANGE,
    GAP_INIT_EVENT_CONN_PHY_UPDATE,
    GAP_INIT_EVENT_TX_POWER_REPORT,
    GAP_INIT_EVENT_RECV_KEY_METERIAL,
    GAP_INIT_EVENT_RECV_SEC_REQUEST,
    GAP_INIT_EVENT_RECV_SMP_REQUIRE,
    GAP_INIT_EVENT_PAIRING_COMPLETE,
    GAP_INIT_EVENT_FRAME_SPACE_UPDATE,
} gap_init_event_t;

enum gap_decision_instuct_flags
{
    GAP_DECISION_I_FLAG_NEVER_PASSES_TEST    = 0b0000,
    GAP_DECISION_I_FLAG_NO_RELEVANT_NO_CHECK = 0b1000,
    GAP_DECISION_I_FLAG_RELEVANT_CHECK_FAIL  = 0b0100,
    GAP_DECISION_I_FLAG_RELEVANT_CHECK_PASS  = 0b0010,

    GAP_DECISION_I_FLAG_MASK  = 0b1110,
};

enum gap_decision_instuct_fields
{
    // Resolvable Tag subfield
    GAP_DECISION_FIELDS_RESOLVABLE_TAG       = 0x00,
    // AdvMode field (which is always present), just check
    GAP_DECISION_FIELDS_ADV_MODE             = 0x06,
    // The relevant field is the RSSI field
    GAP_DECISION_FIELDS_RSSI                 = 0x07,
    // Using TxPower field and the RSSI to calculated this
    GAP_DECISION_FIELDS_PATH_LOSS            = 0x08,
    // AdvA field, which matches addresses
    GAP_DECISION_FIELDS_ADVA                 = 0x09,
    // N = the relevant field is the Arbitrary Data
    // but only if it contains exactly N - 16 octets
    GAP_DECISION_FIELDS_EXACTLY_N_BYTES_MIN  = 0x11,
    GAP_DECISION_FIELDS_EXACTLY_N_BYTES_MAX  = 0x18,
    // but only if it contains at least N - 32 octets
    GAP_DECISION_FIELDS_LEAST_N_BYTES_MIN    = 0x21,
    GAP_DECISION_FIELDS_LEAST_N_BYTES_MAX    = 0x28,
    // but only if it contains [1, N - 48] octets;
    GAP_DECISION_FIELDS_MOST_N_BYTES_MIN     = 0x31,
    GAP_DECISION_FIELDS_MOST_N_BYTES_MAX     = 0x38,
    // 240 to 255 is Vendor-specific
    GAP_DECISION_FIELDS_VENDOR_SPECIFIC_MIN = 0xF0,
    GAP_DECISION_FIELDS_VENDOR_SPECIFIC_MAX = 0xFF,
};

/**
 * TYPEDEFINES
 *
 *
 */
typedef struct
{
    smp_io_cap_t io_cap;
    uint8_t has_oob_data;
    uint8_t auth_req;
    uint8_t max_enc_key_size;
    uint8_t init_key_dist;
    uint8_t resp_key_dist;
} smp_requirements_t;

typedef struct
{
    uint16_t conn_interval_min_1_25ms; // 0x06 to 0x0C80 * 1.25ms, 0xFFFF no specific value
    uint16_t conn_interval_max_1_25ms; // 0x06 to 0x0C80 * 1.25ms, 0xFFFF no specific value
} gap_conn_interval_t;

typedef struct gap_conn_prefer_params_t
{
    uint16_t conn_interval_min_1_25ms; // connection interal = interval * 1.25ms
    uint16_t conn_interval_max_1_25ms; // connection interal = interval * 1.25ms
    uint16_t max_peripheral_latency; // 0x00 to 0x01F3, max peripheral latency in units of subrated conn intervals
    uint16_t superv_timeout_ms; // 0x0A to 0x0C80 * 10ms, 100ms to 32s
} gap_conn_prefer_params_t;

typedef struct
{
    uint16_t conn_interval_min_1_25ms; // 0x06 to 0x0C80 * 1.25ms, 7.5ms to 4000ms
    uint16_t conn_interval_max_1_25ms; // 0x06 to 0x0C80 * 1.25ms, 7.5ms to 4000ms
    uint16_t max_peripheral_latency; // 0x00 to 0x01F3, max peripheral latency in units of subrated conn intervals
    uint16_t superv_timeout_ms; // 0x0A to 0x0C80 * 10ms, 100ms to 32s
    uint16_t min_ce_length_slots; // min len of connection event, 0x00 to 0xFFFF * 0.625ms
    uint16_t max_ce_length_slots; // max len of connection event, 0x00 to 0xFFFF * 0.625ms
    uint8_t l2cap_trans_id;
    bool update_using_l2cap_req;
} gap_update_params_t;

typedef struct
{
    uint16_t subrate_factor_min; // min subrate factor to be applied to the underlying conn interval, 0x01 to 0x01F4
    uint16_t subrate_factor_max; // max subrate factor to be applied to the underlying conn interval, 0x01 to 0x01F4
    uint16_t max_peripheral_latency; // 0x00 to 0x01F3, max peripheral latency in units of subrated conn intervals
    uint16_t conn_continuation_number; // 0x00 to 0x01F3, default 0x00, num of underlying conn events to remain active after a packet contain a LL PDU with non-zero length is sent or received
    uint16_t superv_timeout_ms; // 0x0A to 0x0C80 * 10ms, 100ms to 32s
} gap_subrate_params_t;

typedef struct
{
    uint16_t frame_space_min_us; // min subrate factor to be applied to the underlying conn interval, 0x01 to 0x01F4
    uint16_t frame_space_max_us; // max subrate factor to be applied to the underlying conn interval, 0x01 to 0x01F4
    uint8_t phy_bits; // @see gap_phy_bit_t at least one bit
    uint16_t spacing_types_bits; // @see gap_spacing_types_bit_e at least one bit
} gap_frame_space_param_t;

typedef struct
{
    gap_link_sec_level_t link_sec;
    gap_data_sign_level_t data_sign_sec;
    uint8_t enc_key_size;
    uint8_t accept_method;
} gap_sec_level_t;

typedef struct
{
    uint8_t link_sec_level: 3; // 0 not exist, 1 no security, 2 unauth, 3 auth, 4 sc auth
    uint8_t big_sec_level: 2; // 0 not exist, 1 no security, 2 unauth, 3 auth
    uint8_t data_sign_sec_level: 2; // 0 no security, 1 unauth, 2 auth
    uint8_t data_sign_sec_exist: 1;
} gap_security_levels_t;

typedef struct
{
    uint8_t session_key_le[GAP_KEY_LEN]; // the shared session key
    uint8_t iv_le[GAP_IV_LEN]; // initialization vector, used as the IV for encrypting and authenticating the Encrypted Data
} __attribute__((packed)) gap_key_material_t;

typedef struct
{
    gap_key_material_t data;
    bool is_exist;
} gap_encrypted_data_key_material_t;

typedef struct
{
    uint16_t char_end_handle;
    uint16_t char_value_handle;
    uint16_t char_cccd_handle;
    uint8_t service_seqn: 5;
    uint8_t in_128_service: 1;
    uint8_t reliable_write: 1;
    uint8_t writable_aux: 1;
    uint8_t char_prop;
    uint16_t char_uuid;
} __attribute__((packed)) gatt_char_cache_t;

typedef struct
{
    uint16_t char_end_handle;
    uint16_t char_value_handle;
    uint16_t char_cccd_handle;
    uint8_t service_seqn: 5;
    uint8_t in_128_service: 1;
    uint8_t reliable_write: 1;
    uint8_t writable_aux: 1;
    uint8_t char_prop;
    uint8_t uuid_128_le[GATT_UUID_LEN_128BITS];
} __attribute__((packed)) gatt_128_char_cache_t;

typedef struct
{
    uint16_t start_handle;
    uint16_t end_handle;
    uint16_t service_uuid;
} __attribute__((packed)) gatt_service_cache_t;

typedef struct
{
    uint16_t start_handle;
    uint16_t end_handle;
    uint8_t uuid_128_le[GATT_UUID_LEN_128BITS];
} __attribute__((packed)) gatt_128_service_cache_t;

typedef struct
{
    uint8_t server_cache_is_exist: 1;
    uint8_t service_change_unaware: 1;
    uint8_t gatt_client_supp_robust_caching: 1;
    uint8_t gatt_client_supp_eatt_bearer: 1;
    uint8_t gatt_client_supp_recv_multi_notify: 1;
    uint8_t gatt_server_supp_eatt_bearer: 1;
    uint8_t gatt_server_has_service_changed_char: 1;
    uint8_t gatt_server_has_database_hash_char: 1;
} __attribute__((packed)) gatt_server_cache_t;

typedef struct
{
    uint8_t client_cache_seqn;
    uint8_t peer_database_hash[GAP_KEY_LEN];
    gatt_service_cache_t peer_service[GATT_MAX_CACHE_SERVICES];
    gatt_128_service_cache_t peer_128_service[GATT_MAX_CACHE_128_SERVICES];
    gatt_char_cache_t peer_character[GATT_MAX_CACHE_CHARS];
    gatt_128_char_cache_t peer_128_character[GATT_MAX_CACHE_128_CHARS];
} __attribute__((packed)) gatt_client_cache_t;

typedef struct
{
    bt_bdaddr_t peer_addr;
    bool trusted;
    bool for_bt_source;
    uint8_t link_key[GAP_KEY_LEN];
    uint8_t key_type;
    uint8_t cod[GAP_COD_LEN];
} gap_bredr_sec_t;

typedef struct
{
    bt_bdaddr_t peer_addr;
    bt_addr_type_t peer_type;
    /// Pairing done successfully or prev bonded
    uint8_t device_paired: 1;
    /// Device paired but may be not bonded due to bonding_type is non bonding or LE legacy pairing LTK not distributed
    uint8_t device_bonded: 1;
    uint8_t secure_pairing: 1;
    uint8_t bonded_with_num_compare: 1;
    uint8_t bonded_with_passkey_entry: 1;
    uint8_t bonded_with_oob_method: 1;
    uint8_t peer_irk_distributed: 1;
    uint8_t peer_csrk_distributed: 1;
    uint8_t peer_irk[GAP_KEY_LEN];
    uint8_t peer_csrk[GAP_KEY_LEN];
    uint8_t ltk[GAP_KEY_LEN];
    uint8_t local_ltk[GAP_KEY_LEN];
    uint8_t rand[GAP_RAND_LEN];
    uint8_t local_rand[GAP_RAND_LEN];
    uint8_t ediv[GAP_EDIV_LEN];
    uint8_t local_ediv[GAP_EDIV_LEN];
    uint8_t enc_key_size;
} gap_bond_sec_t;

typedef struct
{
    uint32_t is_opened: 1;
    uint32_t is_central: 1;
    uint32_t conn_ready: 1;
    uint32_t authencated: 1;
    uint32_t encrypted: 1;
    uint32_t directed: 1;
    uint32_t conn_from_rs: 1;
    uint32_t new_link_key_notified: 1;
    uint32_t smp_pairing_ongoing: 1;
    uint32_t smp_encrypt_ongoing: 1;
    uint32_t auth_mitm_protection: 1;
    uint32_t reconn_eatt_after_enc: 1;
    uint32_t att_tx_sec_block: 1;
    uint32_t att_rx_sec_block: 1;
    uint32_t peer_pairing_is_bonding: 1;
    uint32_t local_pairing_is_bonding: 1;
    uint32_t peer_pairing_support_ct2: 1;
    uint32_t local_pairing_support_ct2: 1;
    uint32_t set_use_passkey_entry: 1;
    uint32_t set_use_oob_method: 1;
    uint32_t peer_legacy_ltk_received: 1;
    uint32_t peer_legacy_ediv_rand_received: 1;
    uint32_t peer_irk_received: 1;
    uint32_t peer_ia_received: 1;
    uint32_t peer_bt_supp_eatt_fc_mode: 1;
    uint32_t peer_bt_supp_fixed_smp_cid: 1;
    uint32_t ble_gen_link_key_wait_report: 1;
    uint32_t bredr_gen_ltk_wait_report: 1;
    uint32_t bredr_smp_wait_read_key_size: 1;
    uint32_t peer_rpa_is_resolving: 1;
    uint32_t encrypt_wait_report: 1;
    uint32_t update_conn_param_wait_cfm: 1;
} __attribute__((packed)) gap_conn_flag_t;

typedef struct
{
    uint16_t central_addr_reso_support: 1;
    uint16_t only_use_rpa_after_bonding: 1;
    uint16_t gatt_client_supp_robust_caching: 1;
    uint16_t gatt_client_supp_eatt_bearer: 1;
    uint16_t gatt_client_supp_recv_multi_notify: 1;
    uint16_t gatt_server_supp_eatt_bearer: 1;
    uint16_t gatt_server_has_service_changed_char: 1;
    uint16_t gatt_server_has_database_hash_char: 1;
    uint16_t gatt_service_change_unaware: 1;
    uint32_t le_feat_page_0[GAP_FEAT_PAGE_0_NUM_U32];
    uint32_t le_feat_page_1[GAP_FEAT_PAGE_1_NUM_U32];
    uint8_t service_database_hash[GAP_KEY_LEN];
    struct list_node srvc_list;
} gap_peer_info_t;

/**
 * IRK can be assigned, or randomly generated by the device during manufacturing, or some other method could
 * be used. CSRK is used to sign data in a connection. A device that has received CSRK can verify signatures
 * generated by the distributing device. CSRK can be assigned or randomly generated by the device during
 * manufacturing, or some other method could be used.
 *
 * LE legacy pairing generation of LTK, EDIV and Rand, new values of LTK, EDIV, and Rand shall be generated
 * each time they are distributed. The generated LTK size shall not be longer then the negotiated encryption
 * key size, so its size may need to be shortened.
 *
 */
typedef struct
{
    uint16_t conn_interval_1_25ms; // 0x06 to 0x0C80 * 1.25ms, 7.5ms to 4000ms
    uint16_t peripheral_latency; // num of subrated conn events, 0x00 to 0x1F3 (499)
    uint16_t superv_timeout_ms; // 0x0A to 0x0C80 * 10ms, 100ms to 32s
    uint16_t central_clock_accuracy; // only valid on Peripheral, on Central shall be set to 0x00
    uint16_t subrate_factor; // 0x01 to 0x01F4, subrate factor applied to the specified underlying conn interval
    uint16_t conn_continuation_number; // 0x00 to 0x01F3, num of underlying conn events to remain active after a packet contain a LL PDU with non-zero length is sent or received
} gap_conn_timing_t;

typedef struct
{
    uint16_t conn_interval_min_1_25ms;  // 0x06 to 0x0C80 * 1.25ms, 7.5ms to 4000ms
    uint16_t conn_interval_max_1_25ms;  // 0x06 to 0x0C80 * 1.25ms, 7.5ms to 4000ms
    uint16_t max_peripheral_latency;    // 0x00 to 0x01F3, max peripheral latency in units of subrated conn intervals
    uint16_t superv_timeout_ms;         // default 5s, 0x0A to 0x0C80 * 10ms, 100ms to 32s
    uint16_t min_ce_length_slots;       // default 0, min len of connection event, 0x00 to 0xFFFF * 0.625ms
    uint16_t max_ce_length_slots;       // default 8, max len of connection event, 0x00 to 0xFFFF * 0.625ms
} gap_conn_timing_config_t;

struct gap_conn_item_t;

typedef struct
{
    uint8_t error_code;
    uint8_t con_idx;
    uint16_t connhdl;
    bt_addr_type_t own_addr_type;
    bt_addr_type_t peer_type;
    bt_bdaddr_t peer_addr;
    struct gap_conn_item_t *conn;
} gap_conn_param_t;

typedef struct
{
    uint8_t error_code;
    uint8_t con_idx;
    uint16_t connhdl;
    bt_addr_type_t own_addr_type;
    bt_addr_type_t peer_type;
    bt_bdaddr_t peer_addr;
    struct gap_conn_item_t *conn;
    uint16_t mtu;
} gap_conn_mtu_exchanged_t;

typedef struct
{
    uint8_t error_code;
    uint8_t role; // 0 central, 1 perpherial
    bt_addr_type_t peer_type;
    bt_bdaddr_t peer_addr;
} gap_conn_failed_t;

typedef struct
{
    uint8_t con_idx;
    uint16_t connhdl;
    bt_addr_type_t own_addr_type;
    bt_addr_type_t peer_type;
    bt_bdaddr_t peer_addr;
    struct gap_conn_item_t *conn;
    const gatt_server_cache_t *srv_cache;
    const gatt_client_cache_t *cli_cache;
} gap_conn_cache_ind_t;

typedef struct
{
    /// From hci_ev_le_ltk_request last two params
    uint8_t rand[GAP_RAND_LEN];
    uint8_t ediv[GAP_EDIV_LEN];
} gap_ltk_enc_info_t;

typedef struct
{
    gap_user_confirm_type_t type;
    uint8_t con_idx;
    uint16_t connhdl;
    bt_addr_type_t peer_type;
    bt_bdaddr_t peer_addr;
    struct gap_conn_item_t *conn;
    union
    {
        uint32_t numeric_confirm_value; // 6 digits
        uint32_t display_passkey; // 6 digits
        gap_ltk_enc_info_t ltk_req;
    } data;
} gap_user_confirm_t;

typedef struct
{
    uint8_t error_code;
    uint8_t con_idx;
    uint16_t connhdl;
    bt_addr_type_t own_addr_type;
    bt_addr_type_t peer_type;
    bt_bdaddr_t peer_addr;
    struct gap_conn_item_t *conn;
    gap_update_params_t params_req;
} gap_conn_update_req_t;

typedef struct
{
    uint8_t error_code;
    uint8_t con_idx;
    uint16_t connhdl;
    bt_addr_type_t own_addr_type;
    bt_addr_type_t peer_type;
    bt_bdaddr_t peer_addr;
    struct gap_conn_item_t *conn;
    bool phy_update; // false indicate host read
    gap_le_phy_t tx_phy;
    gap_le_phy_t rx_phy;
} gap_conn_phy_update_t;

typedef struct
{
    gap_le_tx_power_type_t type;
    union
    {
        struct
        {
            int8_t min_tx_power; // -127dBm to 20dBm
            int8_t max_tx_power; // -127dBm to 20dBm
        } range;
        struct
        {
            uint8_t adv_handle;
            int8_t curr_tx_power;
        } adv;
        struct
        {
            uint16_t connhdl;
            gap_le_detail_phy_t phy;
            int8_t curr_tx_power; // -127dBm to 20dBm
            bool is_at_min_level;
            bool is_at_max_level;
            int8_t delta; // 0x7F change is not available or is out of range, 0xXX zero unchanged, positive increased, negative decreased
            int8_t max_tx_power; // -127dBm to 20dBm, or 0x7F GAP_UNKNOWN_TX_POWER
        } local;
        struct
        {
            uint16_t connhdl;
            gap_le_detail_phy_t phy;
            int8_t curr_tx_power; // -127dBm to 20dBm
            bool is_at_min_level;
            bool is_at_max_level;
            int8_t delta; // 0x7F change is not available or is out of range, 0xXX zero unchanged, positive increased, negative decreased
        } remote;
    } u;
} gap_le_tx_power_param_t;

typedef struct
{
    uint8_t error_code;
    uint8_t con_idx;
    uint16_t connhdl;
    bt_addr_type_t own_addr_type;
    bt_addr_type_t peer_type;
    bt_bdaddr_t peer_addr;
    struct gap_conn_item_t *conn;
    gap_le_tx_power_param_t param;
} gap_le_tx_power_report_t;

typedef struct
{
    gap_key_dist_type_t key_type;
    uint8_t con_idx;
    uint16_t connhdl;
    bt_addr_type_t peer_type;
    bt_bdaddr_t peer_addr;
    const uint8_t *recv_key;
    bt_addr_type_t recv_ia_type;
    bt_bdaddr_t recv_ia_addr;
    uint8_t enc_key_size;
    bool link_key_generated_but_still_wait_peer_ia;
    struct gap_conn_item_t *conn;
} gap_recv_key_dist_t;

typedef struct
{
    uint8_t error_code;
    uint8_t con_idx;
    uint16_t connhdl;
    bt_addr_type_t own_addr_type;
    bt_addr_type_t peer_type;
    bt_bdaddr_t peer_addr;
    struct gap_conn_item_t *conn;
    const gap_key_material_t *key_material;
} gap_recv_key_material_t;

typedef struct
{
    uint8_t con_idx;
    uint16_t connhdl;
    bt_addr_type_t own_addr_type;
    bt_addr_type_t peer_type;
    bt_bdaddr_t peer_addr;
    struct gap_conn_item_t *conn;
    uint8_t auth_req;
} gap_recv_sec_request_t;

typedef struct
{
    uint8_t con_idx;
    uint16_t connhdl;
    bt_addr_type_t own_addr_type;
    bt_addr_type_t peer_type;
    bt_bdaddr_t peer_addr;
    struct gap_conn_item_t *conn;
    bool pairing_req_or_rsp;
    smp_requirements_t requirements;
} gap_recv_smp_requirements_t;

typedef struct
{
    uint8_t err_code;
    uint8_t con_idx;
    uint16_t connhdl;
    bt_addr_type_t own_addr_type;
    bt_addr_type_t peer_type;
    bt_bdaddr_t peer_addr;
    struct gap_conn_item_t *conn;
} gap_smp_pairing_cmp_t;

typedef struct
{
    uint8_t error_code;
    uint8_t con_idx;
    uint16_t connhdl;
    bt_addr_type_t own_addr_type;
    bt_addr_type_t peer_type;
    bt_bdaddr_t peer_addr;
    struct gap_conn_item_t *conn;
    uint8_t initiator; // @see HCI_LE_FS_UPD_INITIATOR_LOCAL_HOST
    uint16_t frame_space_us; // Range: 0x0000 to 0x2710
    uint8_t phy_bit; // @see gap_phy_bit_t
    uint16_t spacing_types_bit; // @see gap_spacing_types_bit_e
} gap_frame_space_update_t;

typedef union
{
    void *param_ptr;
    gap_conn_param_t *opened;
    gap_conn_param_t *closed;
    gap_conn_failed_t *conn_failed;
    gap_conn_cache_ind_t *conn_cache;
    gap_conn_mtu_exchanged_t *mtu_exchanged;
    gap_user_confirm_t *user_confirm;
    gap_conn_param_t *encrypted;
    gap_recv_key_dist_t *recv_key_dist;
    gap_conn_update_req_t *update_req;
    gap_conn_param_t *params_update;
    gap_conn_param_t *subrate_change;
    gap_conn_phy_update_t *phy_update;
    gap_le_tx_power_report_t *tx_power;
    gap_recv_key_material_t *recv_key_material;
    gap_recv_sec_request_t *recv_security_req;
    gap_recv_smp_requirements_t *smp_requirements;
    gap_smp_pairing_cmp_t *smp_pairing_cmp;
    gap_frame_space_update_t *frame_space_update;
} gap_conn_callback_param_t;

typedef int (*gap_conn_callback_t)(uintptr_t connhdl, gap_conn_event_t event, gap_conn_callback_param_t param);

typedef struct gap_conn_item_t
{
    hci_conn_type_t conn_type;
    uint8_t con_idx;
    uint16_t connhdl;
    bt_bdaddr_t own_addr;
    bt_addr_type_t own_addr_type;
    bt_addr_type_t peer_type;
    bt_bdaddr_t peer_addr;
    uint16_t sync_handle; // PAwR central role: sync_handle
    bt_bdaddr_t peer_rpa;
    uint8_t ctkd_enc_key_size;
    uint8_t error_code;
    bt_bdaddr_t own_rpa;
    uint8_t adv_handle; // peripheral role: conn from adv_handle
    gap_conn_flag_t conn_flag;
    gap_sec_level_t sec_level;
    gap_conn_timing_t timing;
    gap_conn_callback_t conn_callback;
    gap_peer_info_t peer;
    gap_bond_sec_t sec;
    void *smp_conn;
    void *bap_callback;
    uint8_t *link_key;
} gap_conn_item_t;

typedef struct
{
    const uint8_t *ltk;
    uint8_t enc_key_size;
    bt_addr_type_t peer_type;
    bt_bdaddr_t peer_addr;
    bool ltk_generated_but_still_wait_peer_kdist;
    struct gap_conn_item_t *bredr_conn;
} gap_recv_derived_ltk_t;

typedef struct
{
    uint8_t err_code;
    uint8_t add_item: 1;
    uint8_t remove_item: 1;
    uint8_t clear_item: 1;
    uint8_t enable_monitor: 1;
    uint8_t disable_monitor: 1;
    bt_addr_type_t peer_type;
    bt_bdaddr_t peer_addr;
} gap_adv_monitored_op_t;

typedef struct
{
    uint8_t err_code;
} gap_decision_instruct_t;

typedef struct
{
    const bt_bdaddr_t *p_host_rpa;
    void *priv;
} gap_host_rpa_generated_t;

typedef union
{
    void *param_ptr;
    gap_le_tx_power_param_t *tx_power;
    gap_recv_derived_ltk_t *recv_derived_ltk;
    gap_adv_monitored_op_t *adv_monitored_op;
    gap_decision_instruct_t *decision_instrut;
    gap_host_rpa_generated_t *rpa_generated;
} gap_global_event_param_t;

typedef struct gap_external_function_callbacks
{
    void (*nv_get_local_csrk)(uint8_t *csrk);
    bool (*nv_get_ble_device_by_index)(uint32_t i, gap_bond_sec_t *out);
    bool (*nv_get_ble_device_by_addr)(const gap_conn_item_t *conn, bt_addr_type_t peer_type, const bt_bdaddr_t *peer_addr,
                                      gap_bond_sec_t *out);
    void (*nv_add_ble_device)(const gap_conn_item_t *conn, const gap_bond_sec_t *bond);
    void (*smp_get_upper_requirements)(const gap_conn_item_t *conn, smp_requirements_t *p_requirements);
    void (*gap_get_upper_specific_irk_ia)(const gap_conn_item_t *conn, uint8_t *irk, ble_bdaddr_t *ia);
    bool (*nv_get_bt_device_by_addr)(const bt_bdaddr_t *bd_addr, gap_bredr_sec_t *out);
    bool (*gatt_need_start_mtu_exchange)(const gap_conn_item_t *conn);
    bool (*gatt_allow_data_send)(const gap_conn_item_t *conn);
} gap_ext_func_cbs_t;

typedef int (*gap_global_callback_t)(uintptr_t priv, gap_global_event_t event, gap_global_event_param_t param);

typedef bool (*gap_conn_foreach_func_t)(gap_conn_item_t *conn, void *priv);

typedef struct
{
    bt_l2cap_config_t cfg;
    uint8_t address_reso_support: 1;
    uint8_t use_random_identity_address: 1;
} gap_config_t;

typedef struct
{
    uint8_t pkx[GAP_PUB_KEY_LEN];
    uint8_t pky[GAP_PUB_KEY_LEN];
    uint8_t rand[GAP_KEY_LEN];
    uint8_t confirm[GAP_KEY_LEN];
} gap_smp_oob_auth_data_t;

typedef struct
{
    uint8_t length;
    uint8_t ad_type;
} __attribute__((packed)) gap_dt_head_t;

typedef struct
{
    struct pp_buff *ppb;
} gap_dt_buf_t;

typedef struct
{
    // Resolvable Tag present
    bool resolvable_tag_present;
    // Decision Data length
    uint8_t decision_data_len;
    // Decision Data
    uint8_t decision_data[GAP_DECISION_DATA_MAX_LEN];
} gap_decision_t;

typedef struct
{
    uint8_t uuid_le[GATT_UUID_LEN_128BITS];
} __attribute__((packed)) gap_uuid_128_t;

typedef struct
{
    gap_dt_head_t head;
    uint8_t randomizer_le[5];
} __attribute__((packed)) gap_enc_data_t;

typedef void (*gap_key_callback_t)(void *priv, int error_code, const uint8_t *key);
typedef void (*gap_dt_encrypt_callback_t)(void *priv, int error_code, const gap_enc_data_t *encrypted_data);

typedef struct
{
    uint16_t le_limited_discoverable_mode: 1;
    uint16_t le_general_discoverable_mode: 1;
    uint16_t simu_bredr_support: 1;
    uint16_t srvc_16_uuid_cmpl: 1;
    uint16_t srvc_128_uuid_cmpl: 1;
    uint16_t device_name_cmpl: 1;
    uint16_t has_le_features: 1;
    uint16_t has_manufacturer_data: 1;
    uint16_t has_tx_power_level: 1;
    uint16_t has_periph_prefer_conn_interval: 1;
    uint16_t has_le_role: 1;
    uint16_t has_le_supp_features: 1;
} gap_dt_flags_t;

typedef struct
{
    uint8_t has_oob_flags: 1;
    uint8_t oob_data_present: 1;
    uint8_t le_host_support: 1;
    uint8_t is_random_address: 1;
} gap_dt_oob_flags_t;

typedef struct
{
    gap_dt_flags_t flags;
    uint16_t device_apperance; // valid when non-zero
    uint32_t adv_interval_slots; // >= 40.96s <<advertising interval - long>> data type shall be used
    uint8_t le_role; // 0x00 periph, 0x01 central, 0x02 both and periph preferred for conn, 0x03 both and central preferred for conn
    uint8_t num_srvc_16_uuids;
    uint8_t num_srvc_128_uuids;
    uint8_t num_public_target_addr;
    uint8_t num_random_target_addr;
    uint8_t device_name_len;
    uint8_t big_info_data_len;
    int8_t tx_power_level;
    bt_addr_type_t le_addr_type;
    gap_dt_oob_flags_t smp_oob_flags;
    uint16_t manufacturer_company_id;
    const uint8_t *manufacturer_data;
    const uint16_t *srvc_16_uuid_le;
    const gap_uuid_128_t *srvc_128_uuid;
    const uint8_t *device_name;
    uint32_t le_feat_page_0[GAP_FEAT_PAGE_0_NUM_U32];
    gap_conn_interval_t periph_prefer_conn_interval; // valid when interval_min is not 0xffff
    bt_bdaddr_t *le_bdaddr;
    bt_bdaddr_t *public_target_addr;
    bt_bdaddr_t *random_target_addr;
    const uint8_t *chm_indication;
    const uint8_t *ascs_srvc_data;
    // Broadcast Audio Announcement: Broadcast ID
    const uint8_t *broadcast_id;
    // Basic Audio Announcement: BASE
    struct basic_audio_annoucement
    {
        uint8_t length;
        const uint8_t *base;
    } base_info;
    // Public Broadcast Announcement: PBA
    struct public_broadcast_annoucement
    {
        uint8_t length;
        const uint8_t *pba;
    } pba_info;
    // Broadcast Name
    struct broadcast_name
    {
        uint8_t length;
        const uint8_t *bc_name;
    } broadcast_name;
    const uint8_t *smp_tk;
    const uint8_t *big_info;
    const uint8_t *broadcast_code;
    const uint8_t *rsi; // resolvable set identifier - 6 bytes
} gap_dt_parsed_t;

typedef struct
{
    uint16_t extended_adv: 1;
    uint16_t legacy_pdu: 1;
    uint16_t connectable: 1;
    uint16_t scannable: 1;
    uint16_t directed: 1;
    uint16_t scan_rsp: 1;
    uint16_t cmpl_adv_data: 1;
    uint16_t incmpl_adv_data: 1;
    uint16_t has_more_data: 1;
    uint16_t peer_anonymous: 1;
    uint16_t direct_unresolv_addr: 1;
    uint16_t primary_phy: 2;
    uint16_t secondary_phy: 2;
} gap_adv_flags_t;

typedef struct
{
    gap_adv_flags_t adv;
    bt_bdaddr_t peer_addr;
    bt_addr_type_t peer_type;
    bt_addr_type_t direct_addr_type;
    bt_bdaddr_t direct_addr; // TargetA or Public IA or Random IA
    const uint8_t *data;
    uint8_t data_length;
    uint8_t adv_set_id;
    uint16_t sync_handle;
    uint16_t pa_interval;
    int8_t tx_power;
    int8_t rssi;
    uint16_t pa_event_counter;
    uint8_t subevent;
    uint8_t response_slot; // 0x00 to 0xFF, the response slot the data was received in
    bool aux_sync_subevent_ind_not_transmitted;
    bool fail_rx_aux_sync_subevent_rsp;
    bool fail_rx_aux_sync_subevent_ind;
    gap_le_cte_type_t cte_type; // 0x00 to 0x02, 0xFF no cte
    gap_coded_phy_prefer_t primary_coding;
    gap_coded_phy_prefer_t secondary_coding;
    gap_dt_parsed_t parsed;
} gap_adv_report_t;

typedef struct
{
    bt_bdaddr_t peer_addr;
    bt_addr_type_t peer_type;
    uint8_t user: 7;
    uint8_t is_inuse: 1;
} gap_filter_item_t;

typedef struct
{
    bt_bdaddr_t peer_addr;
    bt_addr_type_t peer_type;
    uint8_t device_privacy_mode: 1;
    uint8_t is_inuse: 1;
    uint8_t peer_irk[GAP_KEY_LEN];
} gap_resolv_item_t;

typedef struct
{
    bt_bdaddr_t peer_addr;
    bt_addr_type_t peer_type;
    /// @see enum gap_monitored_advertisers_condition
    uint8_t condition;
} gap_monitored_report_t;

typedef struct
{
    bt_bdaddr_t peer_addr;
    bt_addr_type_t peer_type;
} gap_monitored_adv_t;

typedef struct
{
    uint8_t adv_handle;
    bt_status_t error_code;
} gap_adv_started_t;

typedef struct
{
    uint8_t adv_handle;
    bt_status_t error_code;
} gap_adv_stopped_t;

typedef struct
{
    uint8_t adv_handle;
    uint8_t data_type;
    bt_status_t error_code;
} gap_adv_set_data_t;

typedef struct
{
    uint8_t adv_handle;
    bt_addr_type_t peer_type;
    bt_bdaddr_t peer_addr;
} gap_adv_scan_req_t;

typedef struct
{
    uint8_t adv_handle;
    bt_status_t error_code;
} gap_pa_enabled_t;

typedef struct
{
    uint8_t adv_handle;
    bt_status_t error_code;
} gap_pa_disabled_t;

typedef struct
{
    uint8_t adv_handle;
    uint8_t subevent_start; // 0x00 to 0x7F, the first subevent that data is requested for
    uint8_t subevent_data_count; // 0x01 to 0x80, num of subevents that data is requested for
} gap_pa_subevent_data_req_t;

typedef gap_adv_report_t gap_pa_response_report_t;

typedef union
{
    void *param_ptr;
    gap_adv_started_t *adv_started;
    gap_adv_stopped_t *adv_stopped;
    gap_adv_set_data_t *adv_set_data;
    gap_adv_scan_req_t *scan_req;
    gap_pa_enabled_t *pa_enabled;
    gap_pa_disabled_t *pa_disable;
    gap_pa_subevent_data_req_t *pa_subevent_data_req;
    gap_pa_response_report_t *pa_response_report;
    gap_conn_param_t *conn_opened;
    gap_conn_param_t *conn_closed;
    gap_conn_failed_t *conn_failed;
    gap_conn_cache_ind_t *conn_cache;
    gap_conn_mtu_exchanged_t *mtu_exchanged;
    gap_user_confirm_t *user_confirm;
    gap_conn_param_t *conn_encrypted;
    gap_recv_key_dist_t *recv_key_dist;
    gap_conn_update_req_t *conn_update_req;
    gap_conn_param_t *conn_params_update;
    gap_conn_param_t *conn_subrate_change;
    gap_conn_phy_update_t *conn_phy_update;
    gap_le_tx_power_report_t *tx_power;
    gap_recv_key_material_t *recv_key_material;
    gap_recv_sec_request_t *recv_security_req;
    gap_recv_smp_requirements_t *smp_requirements;
    gap_smp_pairing_cmp_t *smp_pairing_cmp;
    gap_frame_space_update_t *frame_space_update;
} gap_adv_callback_param_t;

typedef int (*gap_adv_callback_t)(uintptr_t adv, gap_adv_event_t event, gap_adv_callback_param_t param);

typedef struct
{
    /**
     * Recommended advertising interval for user initiated connectable modes:
     *      connectable undirected mode
     *      limited discoverable and connectable undirected mode
     *      general discoverable and connectable undirected mode
     *      connectable directed low duty cycle mode
     */
    uint32_t min_adv_fast_interval_ms; // LE 1M PHY
    uint32_t max_adv_fast_interval_ms; // LE 1M PHY
    uint32_t min_adv_fast_interval_coded_ms; // LE Coded PHY
    uint32_t max_adv_fast_interval_coded_ms; // LE Coded PHY
    /**
     * Recommended advertising interval for user initiated non-connectable modes:
     *      non-discoverable mode
     *      non-connectable mode
     *      limited discoverable mode
     *      general discoverable mode
     * Note: When advertising interval values of less than 100ms are used for
     * non-connectable or scannable undirected advertising in environments where
     * the advertiser can interfere with other devices, it is recommended that
     * steps be taken to minimize the interference. For example, the advertising
     * might be alternately enabled for only a few seconds and disabled for
     * several minutes.
     */
    uint32_t min_adv_slow_interval_ms; // LE 1M PHY
    uint32_t max_adv_slow_interval_ms; // LE 1M PHY
    uint32_t min_adv_slow_interval_coded_ms; // LE Coded PHY
    uint32_t max_adv_slow_interval_coded_ms; // LE Coded PHY
    /**
     * Recommended advertising interval for background advertising other then Directed Connectable High Duty Mode:
     */
    uint32_t min_adv_bg_interval_ms; // LE 1M PHY
    uint32_t max_adv_bg_interval_ms; // LE 1M PHY
    uint32_t min_adv_bg_interval_coded_ms; // LE Coded PHY
    uint32_t max_adv_bg_interval_coded_ms; // LE Coded PHY
} gap_adv_timing_t;

typedef struct
{
    bool force_start;
    bool connectable;
    bool scannable;
    bool directed_adv;
    bool anonymous_adv;
    bool high_duty_directed_adv; // <= 3.75ms adv interval
    bool use_legacy_pdu;
    bool include_tx_power_data; // include TxPower in the ext header of at least one adv pdu
    bool use_decisions_pdu; // Use decision PDUs when advertising
    bool include_adva_in_decisions; // Include AdvA in the extended header of all decision PDUs
    bool include_adi_in_decisions; // Include ADI in the extended header of all decision PDUs
    bool own_addr_use_rpa;
    bt_addr_type_t own_addr_type;
    bt_addr_type_t peer_type;
    bt_bdaddr_t peer_addr;
    gap_adv_policy_t policy;
    bool use_custom_local_addr;
    bool use_fake_btc_rpa_when_no_irk_exist;
    bt_bdaddr_t custom_local_addr;
    bool limited_discoverable_mode;
    bool fast_advertising;
    bool continue_advertising;
    bool start_bg_advertising;
    bool has_prefer_adv_tx_power;
    bool has_custom_adv_timing;
    bool enable_scan_req_notify;
    int8_t adv_tx_power;
    uint8_t activity_priority;
    uint8_t adv_channel_map;
    uint8_t secondary_adv_max_skip;
    gap_le_phy_t primary_adv_phy;
    gap_coded_phy_prefer_t primary_coded_phy_prefer;
    gap_le_phy_t secondary_adv_phy;
    gap_coded_phy_prefer_t secondary_coded_phy_prefer;
    gap_adv_timing_t adv_timing;
    gap_dt_buf_t adv_data;
    gap_dt_buf_t scan_rsp_data;
    gap_decision_t decision_data;
    uint32_t duration_ms;
    uint8_t max_ext_adv_evts;
} gap_adv_param_t;

typedef struct
{
    uint32_t adv_interval_min;
    uint32_t adv_interval_max;
    uint16_t adv_event_props;
    uint8_t own_addr_type;
    uint8_t peer_type;
    uint8_t adv_channel_map;
    uint8_t adv_filter_policy;
    bt_bdaddr_t local_addr;
    bt_bdaddr_t peer_addr;
    int8_t adv_tx_power;
    uint8_t primary_adv_phy;
    uint8_t primary_coded_phy_prefer;
    uint8_t secondary_adv_phy;
    uint8_t secondary_coded_phy_prefer;
    uint8_t secondary_adv_max_skip;
    uint8_t scan_req_notify_enable;
} gap_adv_set_param_t;

typedef struct
{
    bool adv_params_set;
    bool adv_enabled;
    uint8_t adv_set_id;
    uint8_t adv_handle;
    bool legacy_advertising;
    int8_t selected_tx_power;
    bool fast_advertising;
    bool continue_advertising;
    bool start_bg_advertising;
    bool directed_advertising;
    uint8_t activity_priority;
    uint8_t adv_stop_timer;
    bool pa_is_enabled;
    uint32_t duration_ms;
    gap_dt_buf_t adv_data;
    gap_dt_buf_t scan_rsp_data;
    // Keep it until remove adv set
    gap_decision_t decision_data;
    gap_adv_callback_t adv_callback;
    gap_adv_set_param_t set_param;
    gap_adv_timing_t timing_cfg;
} gap_advertising_t;

typedef struct
{
    bt_status_t error_code;
} gap_scan_started_t;

typedef struct
{
    bt_status_t error_code;
} gap_scan_stopped_t;

typedef struct
{
    uint16_t sync_handle; // 0x0000 to 0x0EFE, sync_handle identifying the pa train
    uint8_t num_bis; // 0x01 to 0x1F, value of the Num_BIS subfield of the BIGInfo field
    uint8_t nse; // 0x01 to 0x1F, value of the NSE subfield of the BIGInfo field
    uint16_t iso_interval; // iso_interval subfield of the BIGInfo field
    uint8_t bn; // 0x01 to 0x07, BN subfield of the BIGInfo field
    uint8_t pto; // 0x00 to 0x0F, pre-transmission offset, PTO subfield of the BIGInfo field
    uint8_t irc; // 0x01 to 0x0F, IRC subfield of the BIGInfo field
    uint16_t max_pdu; // 0x01 to 0xFB, max_pdu subfiled of the BIGInfo
    uint32_t sdu_interval; // sdu_interval subfield of the BIGInfo field
    uint16_t max_sdu; // 0x01 to 0x0FFF, max_sdu subfield of the BIGInfo
    gap_le_phy_t big_phy; // 0x01 the BIG is transmitted on the LE 1M PHY, 0x02 LE 2M, 0x03 LE Coded
    uint8_t framed; // 0x00 unframed 0x01 framed
    uint8_t encrypted; // 0x00 BIG carries unencrypted data, 0x01 BIG carries encrypted data
} gap_big_info_adv_report_t;

typedef struct gap_pa_sync_establish_t gap_pa_sync_establish_t;
typedef struct gap_pa_sync_terminated_t gap_pa_sync_terminated_t;

typedef union
{
    void *param_ptr;
    gap_scan_started_t *scan_started;
    gap_scan_stopped_t *scan_stopped;
    const gap_adv_report_t *adv_report;
    const gap_pa_sync_establish_t *pa_sync_estb;
    const gap_pa_sync_terminated_t *pa_sync_term;
    const gap_adv_report_t *per_adv_report;
    const gap_big_info_adv_report_t *big_info_report;
    const gap_monitored_report_t *adv_monitored_report;
} gap_scan_callback_param_t;

typedef int (*gap_scan_callback_t)(uintptr_t scan, gap_scan_event_t event, gap_scan_callback_param_t param);

typedef struct
{
    // user initiated discovery or connection establishment
    uint16_t fg_scan_interval_ms;               // default 30ms~60ms    LE 1M PHY
    uint16_t fg_scan_window_ms;                 // default 30ms         LE 1M PHY
    uint16_t fg_scan_interval_coded_ms;         // default 90ms~180ms   LE Coded PHY
    uint16_t fg_scan_window_coded_ms;           // default 90ms         LE Coded PHY
    uint16_t fg_slow_scan_interval_ms;          // default 30ms~60ms    LE 1M PHY
    uint16_t fg_slow_scan_window_ms;            // default 30ms         LE 1M PHY
    uint16_t fg_slow_scan_interval_coded_ms;    // default 90ms~180ms   LE Coded PHY
    uint16_t fg_slow_scan_window_coded_ms;      // default 90ms         LE Coded PHY
    uint32_t fg_scan_time_ms;                   // default 30.72s
    // background discovery or connection establishment
    uint16_t bg_scan_interval_ms;               // default 1.28s        LE 1M PHY
    uint16_t bg_scan_window_ms;                 // default 11.25ms      LE 1M PHY
    uint16_t bg_scan_interval_coded_ms;         // default 3.84s        LE Coded PHY
    uint16_t bg_scan_window_coded_ms;           // default 33.75ms      LE Coded PHY
    // slow discovery or connection establishment
    uint16_t bg_slow_scan_interval_ms;          // default 2.56s        LE 1M PHY
    uint16_t bg_slow_scan_window_ms;            // default 22.5ms       LE 1M PHY
    uint16_t bg_slow_scan_interval_coded_ms;    // default 7.68s        LE Coded PHY
    uint16_t bg_slow_scan_window_coded_ms;      // default 67.5ms       LE Coded PHY
} gap_scan_timing_t;

typedef struct
{
    bt_addr_type_t own_addr_type;
    /// @see gap_scanning_filter_policy
    uint8_t filter_policy;
    bool active_scan;
    bool filter_duplicated;
    bool slow_scan;
    bool continue_scanning;
    bool has_custom_scan_timing;
    bool dont_auto_start;
    bool legacy;
    uint8_t phys;
    gap_scan_timing_t scan_timing;
    uint32_t duration_ms; // 0x01 to 0xFFFF * 10ms, 10ms to 655.35s (655350ms)
} gap_scan_param_t;

typedef struct
{
    bt_status_t error_code;
} gap_init_started_t;

typedef struct
{
    bt_status_t error_code;
} gap_init_stopped_t;

typedef union
{
    void *param_ptr;
    gap_scan_started_t *scan_started;
    gap_scan_stopped_t *scan_stopped;
    const gap_adv_report_t *adv_report;
    gap_init_started_t *init_started;
    gap_init_stopped_t *init_stopped;
    gap_conn_param_t *conn_opened;
    gap_conn_param_t *conn_closed;
    gap_conn_failed_t *conn_failed;
    gap_conn_cache_ind_t *conn_cache;
    gap_conn_mtu_exchanged_t *mtu_exchanged;
    gap_user_confirm_t *user_confirm;
    gap_conn_param_t *conn_encrypted;
    gap_recv_key_dist_t *recv_key_dist;
    gap_conn_update_req_t *conn_update_req;
    gap_conn_param_t *conn_params_update;
    gap_conn_param_t *conn_subrate_change;
    gap_conn_phy_update_t *conn_phy_update;
    gap_le_tx_power_report_t *tx_power;
    gap_recv_key_material_t *recv_key_material;
    gap_recv_sec_request_t *recv_security_req;
    gap_recv_smp_requirements_t *smp_requirements;
    gap_smp_pairing_cmp_t *smp_pairing_cmp;
    gap_frame_space_update_t *frame_space_update;
} gap_init_callback_param_t;

typedef int (*gap_init_callback_t)(uintptr_t init, gap_init_event_t event, gap_init_callback_param_t param);

typedef struct
{
    uint16_t min_initial_conn_interval_1_25ms;  // default 30~50ms  LE 1M PHY
    uint16_t max_initial_conn_interval_1_25ms;  // default 30~50ms  LE 1M PHY
    uint16_t min_initial_conn_interval_coded;   // default 90~150ms LE Coded PHY
    uint16_t max_initial_conn_interval_coded;   // default 90~150ms LE Coded PHY
    uint16_t initial_superv_timeout_ms;         // 100ms to 32s
    uint16_t initial_min_ce_length_slots;       // min len of connection event, 0x00 to 0xFFFF * 0.625ms
    uint16_t initial_max_ce_length_slots;       // max len of connection event, 0x00 to 0xFFFF * 0.625ms
    uint32_t init_proc_timeout_ms;              // default 30.72s, bap 30s
} gap_init_timing_t;

typedef struct
{
    bt_addr_type_t own_addr_type;
    bt_addr_type_t peer_type;
    bt_bdaddr_t peer_addr;
    /// @see gap_initiator_filter_policy
    uint8_t filter_policy;
    bool continue_initiating;
    uint8_t initiating_phys;
    bool has_custom_scan_timing;
    bool has_custom_init_timing;
    gap_scan_timing_t scan_timing; // initiator use scan_timing to do initiating scan
    gap_init_timing_t init_timing; // init_timing is the initial ble connection parameers
} gap_init_param_t;

typedef struct
{
    // Use mask to filter arbitary data
    uint8_t arbitary_mask[GAP_DECISION_DATA_MAX_LEN];
    // Match target pass check
    uint8_t arbitary_target[GAP_DECISION_DATA_MAX_LEN];
} gap_decision_arbitary_check_t;

typedef struct
{
    // Min RSSI in dbm
    int8_t rssi_min_dbm;
    // Max RSSI in dbm
    int8_t rssi_max_dbm;
    // octets 2 - 15 RFU
} gap_decision_rssi_check_t;

typedef struct
{
    // Check mode
    uint8_t check;
    // 0 for Public 1 for random
    bt_addr_type_t addr_type_1;
    // Address 1
    bt_bdaddr_t address_1;
    // 0 for Public 1 for random
    bt_addr_type_t addr_type_2;
    // Address 2
    bt_bdaddr_t address_2;
    // octets 15 RFU
} gap_decision_adva_check_t;

typedef struct
{
    // Min Path Loss in dbm
    uint8_t loss_min_db;
    // Max Path Loss in dbm
    uint8_t loss_max_db;
    // octets 2 - 15 RFU
} gap_decision_passloss_check_t;

typedef struct
{
    // Event type of adv mode @see gap_adv_event_types_bit
    uint8_t event_type;
    // octets 1- 15 RFU
} gap_decision_advmode_check_t;

typedef struct
{
    // Start of group tests
    bool test_grp_start;
    // Test Flags @see gap_decision_instuct_flags
    uint8_t test_flags;
    // Test Field
    uint8_t test_fields;
    // Test_Parameters
    uint8_t test_params[GAP_KEY_LEN];
} gap_decision_test_t;

typedef struct
{
    uint8_t num_subevents; // 0x00 to 0x80
    uint8_t subevent_interval_1_25ms; // 0x06 to 0xFF * 1.25ms (7.5ms to 318.75ms)
    uint8_t response_slot_delay_1_25ms; // 0x00 no response slots, 0xXX 0x01 to 0xFE * 1.25ms (1.25ms to 317.5ms) time between the adv packet in a subevent and the 1st response slot
    uint8_t response_slot_spacing_0_125ms; // 0x00 no response slots, 0xXX 0x02 to 0xFF * 0x125ms (0x25ms to 31.875ms) time between response slots
    uint8_t num_response_slots; // 0x00 no response slots, 0xXX 0x01 to 0xFF num of subevent response slots
} gap_pa_subevent_param_t;

typedef struct
{
    uint8_t subevent; // 0x00 to 0x7F subevent index
    uint8_t response_slot_start; // the first response slot to be used in the subevent
    uint8_t response_slot_count; // num of response slots to be used
    uint8_t subevent_data_len; // 0 to 251
    const uint8_t *subevent_data; // ad type formatted subevent data
} gap_pa_subevent_data_t;

typedef struct gap_pa_sync_establish_t
{
    bt_status_t error_code;
    uint16_t pa_sync_hdl;
    bool is_over_past;
    uint16_t acl_conn_hdl;
    uint16_t service_data;
    uint8_t adv_sid;
    uint8_t adv_addr_type; // 0x00 public 0x01 random 0x02 public identity 0x03 random static identity
    bt_bdaddr_t adv_addr;
    uint8_t adv_phy; // 0x01 le 1m, 0x02 le 2m, 0x03 le coded
    uint16_t pa_interval_1_25ms; // 0x06 to 0xFFFF * 1.25ms (7.5ms to 81.9s)
    uint8_t adv_clock_accuracy; // 0x00 to 0x07 500ppm to 20ppm
    uint8_t num_subevents; // 0x00 no subevents, 0x01 to 0x80 num of subevents
    uint8_t subevent_interval_1_25ms; // 0x00 no subevents, 0x06 to 0xFF * 1.25ms (7.5ms to 318.75ms)
    uint8_t response_slot_delay_1_25ms; // 0x00 no response slots, 0x01 to 0xFE * 1.25ms (1.25ms to 317.6ms)
    uint8_t response_slot_spacing_0_125ms; // 0x00 no response slots, 0x02 to 0xFF * 0.125ms (0.25ms to 31.875ms)
} gap_pa_sync_establish_t;

typedef struct gap_pa_sync_terminated_t
{
    uint16_t pa_sync_hdl;
    uint8_t reason;
} gap_pa_sync_terminated_t;

typedef gap_scan_event_t gap_pa_sync_event_t;
typedef gap_scan_callback_param_t gap_pa_sync_callback_param_t;
typedef gap_scan_callback_t gap_pa_sync_callback_t;

typedef struct
{
    uint8_t options;
    uint8_t adv_set_id;
    bt_addr_type_t adv_addr_type;
    bt_bdaddr_t adv_addr;
    uint16_t skip;
    uint16_t sync_timeout_10ms;
    uint8_t sync_cte_type;
} gap_pa_sync_param_t;

typedef struct
{
    uint8_t response_subevent; // 0x00 to 0x7F identify the subevent of PAwR train to response
    uint8_t response_slot; // 0x00 to 0xFF identify the response slot of the PAwR train
    uint8_t response_data_len; // 0 to 251
    const uint8_t *response_data; // ad type formatted response data
} gap_pa_response_data_t;

typedef struct
{
    gap_dt_encrypt_callback_t func;
    void *priv;
} gap_enc_data_env_t;

typedef struct
{
    bt_bdaddr_t local_rpa;
    void (*cmpl)(void *priv, const bt_bdaddr_t *local_rpa);
    void *priv;
} gap_gen_rpa_t;

typedef struct
{
    gap_bond_sec_t record;
    bt_bdaddr_t peer_rpa;
    uint8_t record_idx;
    void (*cmpl)(void *priv, const gap_bond_sec_t *out);
    void *priv;
} gap_resolve_rpa_t;

typedef struct
{
    bool scan_enabled;
    bool legacy_scanning;
    bool background_scan;
    bool initiating_scan;
    bt_addr_type_t own_addr_type;
    uint8_t scan_handle;
    uint8_t scan_stop_timer;
    uint16_t period_1_28s;
    uint32_t duration_ms;
    uint16_t scan_interval_slots;
    uint16_t scan_interval_coded;
    uint16_t scan_window_slots;
    uint16_t scan_window_coded;
    gap_scan_param_t param;
    gap_scan_callback_t scan_callback;
} gap_scanning_t;

typedef struct
{
    bool legacy_initiating;
    bool is_conn_creating;
    bool is_direct_initiating;
    uint8_t peer_type;
    bt_addr_type_t own_addr_type;
    bt_bdaddr_t peer_addr;
    uint32_t init_proc_timeout_ms;
    bool timeout_and_restart_initiating;
    bool start_bg_initiating;
    bool peer_is_ble_audio;
    uint8_t init_handle;
    uint8_t init_stop_timer;
    uint8_t pa_adv_handle;
    uint8_t sd_subevent;
    uint16_t scan_interval_slots;
    uint16_t scan_interval_coded;
    uint16_t scan_window_slots;
    uint16_t scan_window_coded;
    uint16_t min_conn_interval_1_25ms;  // 0x06 to 0x0C80 * 1.25ms, 7.5ms to 4s
    uint16_t max_conn_interval_1_25ms;  // 0x06 to 0x0C80 * 1.25ms, 7.5ms to 4s
    uint16_t min_conn_interval_coded;   // 0x06 to 0x0C80 * 1.25ms, 7.5ms to 4s
    uint16_t max_conn_interval_coded;   // 0x06 to 0x0C80 * 1.25ms, 7.5ms to 4s
    uint16_t superv_timeout_ms;         // 100ms to 32s
    uint16_t min_ce_length_slots;       // min len of connection event, 0x00 to 0xFFFF * 0.625ms
    uint16_t max_ce_length_slots;       // max len of connection event, 0x00 to 0xFFFF * 0.625ms
    gap_init_callback_t init_callback;
    gap_init_param_t init_param;
} gap_initiating_t;

typedef struct
{
    gap_advertising_t *adv;
} gap_advertising_item_t;

typedef struct
{
    bool phy_update; // false indicate host read
    gap_le_phy_t tx_phy;
    gap_le_phy_t rx_phy;
} gap_conn_phy_param_t;

typedef struct
{
    /// PA sync handle
    uint16_t pa_sync_hdl;
    /// Periodic Adv Timing
    uint8_t adv_phy; // 0x01 le 1m, 0x02 le 2m, 0x03 le coded
    uint16_t pa_interval_1_25ms; // 0x06 to 0xFFFF * 1.25ms (7.5ms to 81.9s)
    uint8_t adv_clock_accuracy; // 0x00 to 0x07 500ppm to 20ppm
    uint8_t num_subevents; // 0x00 no subevents, 0x01 to 0x80 num of subevents
    uint8_t subevent_interval_1_25ms; // 0x00 no subevents, 0x06 to 0xFF * 1.25ms (7.5ms to 318.75ms)
    uint8_t response_slot_delay_1_25ms; // 0x00 no response slots, 0x01 to 0xFE * 1.25ms (1.25ms to 317.6ms)
    uint8_t response_slot_spacing_0_125ms; // 0x00 no response slots, 0x02 to 0xFF * 0.125ms (0.25ms to 31.875ms)
    /// Sync param from upper
    gap_pa_sync_param_t pa_sync_param;
    gap_pa_sync_callback_t pa_sync_callback;
} gap_pa_sync_t;

typedef struct
{
    gap_pa_sync_t *pa_sync;
} gap_pa_sync_item_t;

typedef struct
{
    uint32_t adv_seqn;
    uint8_t adv_handle;
    uint8_t own_addr_type: 2;
    uint8_t directed_advertising: 1;
    bt_bdaddr_t local_addr;
    gap_adv_callback_t adv_callback;
} __attribute__((packed)) gap_adv_param_for_conn_t;

typedef struct
{
    uint8_t status;
    uint16_t conn_handle;
    uint8_t role; // 0x00 Central, 0x01 Peripheral
    uint8_t peer_addr_type; // 0x00 public, 0x01 random, 0x02 public ia, 0x03 random ia
    bt_bdaddr_t peer_addr;
    uint8_t local_rpa[GAP_ADDR_LEN]; // only valid own_addr_type 0x02 0x03 and non-zero local IRK, otherwise shall return all zeros
    uint8_t peer_rpa[GAP_ADDR_LEN]; // only valid when peer_addr_type is 0x02 or 0x03, for other peer_addr_type shall set all zeros
    uint16_t conn_interval; // 0x06 to 0x0C80 * 1.25ms, 7.5ms to 4000ms
    uint16_t peripheral_latency; // peripheral latency in num of subrated conn events, 0x00 to 0x01F3 (499)
    uint16_t superv_timeout; // 0x0A to 0x0C80 * 10ms, 100ms to 32s
    uint8_t central_clock_accuracy; // 0x00 500, 0x01 250, 0x02 150, 0x03 100, 0x04 75, 0x05 50, 0x06 30, 0x07 20ppm, only valid on Peripheral, on Central shall be set to 0x00
} __attribute__((packed)) gap_le_switch_link_setup_t;

#ifdef __cplusplus
extern "C" {
#endif

/**
 * FUNCTIONS DECLARATIONS
 *
 *
 */

/**
 * @brief Construct connection bitfield
 *
 * @param[in] con_idx  Connection local index
 *
 * @return uint32_t    Connection bitfield
 */
uint32_t gap_conn_bf(uint8_t con_idx);

/**
 * @brief Get real connection handle from conidx
 *
 * @param[in] con_idx  Connection local index
 *
 * @return uint16_t    Connection handle
 */
uint16_t gap_conn_hdl(uint8_t con_idx);

/**
 * @brief Construct unreal connection handle
 *
 * @param[in] con_idx  Connection local index
 *
 * @return uint16_t    Connection handle
 */
uint16_t gap_conn_idx_as_hdl(uint8_t con_idx);

/**
 * @brief gap module init api
 *
 * @param[in] cfg     gap init configurations
 * @param[in] global_callback
